#include<stdio.h>
int main(){
	int a[3][4] = {{1,2,3,4},{5,6,7,8},{4,3,2,1}};
	printf("%d\n",a); //第0行元素的地址
	printf("%d\n",a+1);//第1行元素的地址
	printf("%d\n",&a[0][0]);//第0行第0列元素的地址
	printf("%d\n",*(a+0)+0);//第0行第0列元素的地址 
	printf("%d\n",*(*(a+0)+0));//第0行第0列元素的值
	printf("%d\n",*(*(a+2)+2));//第2行第2列元素的值
	printf("%d\n",*(a+1)+2);//第1行第2列元素的地址
	printf("%d\n",*(*(a+1)+2));//第1行第2列元素的值
	printf("%d\n",*a+1);//第0行第1列元素的地址 
	printf("%d\n",*(*a+1));//第0行第1列元素的值 
	printf("%d\n",a[1]+1);//第1行第1列元素的地址
	printf("%d\n",*(a[1]+1));//第1行第1列元素的值 
	printf("%d\n",a[1][1]);//第1行第1列元素的值 
	printf("%d\n",a[0]);//第0行第0列元素的地址 
	printf("%d\n",*(a[0]));//第0行第0列元素的值
	return 0;	 
	}


